src/main/resources/autotest/testreport/sysbench_point_select_20190505040605.log
sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 14356.17 qps: 14356.17 (r/w/o: 14356.17/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 14410.01 qps: 14410.01 (r/w/o: 14410.01/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 12458.48 qps: 12458.48 (r/w/o: 12458.48/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 14503.81 qps: 14503.81 (r/w/o: 14503.81/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 14477.02 qps: 14477.02 (r/w/o: 14477.02/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 12404.67 qps: 12404.67 (r/w/o: 12404.67/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 14286.41 qps: 14286.41 (r/w/o: 14286.41/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 14268.10 qps: 14268.10 (r/w/o: 14268.10/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 14333.60 qps: 14333.60 (r/w/o: 14333.60/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 14458.62 qps: 14458.62 (r/w/o: 14458.62/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 14587.81 qps: 14587.81 (r/w/o: 14587.81/0.00/0.00) lat (ms,95%): 1.73 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 14501.17 qps: 14501.17 (r/w/o: 14501.17/0.00/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1690516
        write:                           0
        other:                           0
        total:                           1690516
    transactions:                        1690516 (14086.56 per sec.)
    queries:                             1690516 (14086.56 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      14086.5558
    time elapsed:                        120.0092s
    total number of events:              1690516

Latency (ms):
         min:                                    0.12
         avg:                                    1.14
         max:                                 1635.18
         95th percentile:                        1.76
         sum:                              1918838.75

Threads fairness:
    events (avg/stddev):           105657.2500/702.78
    execution time (avg/stddev):   119.9274/0.00

sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 13907.29 qps: 13907.29 (r/w/o: 13907.29/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 14118.69 qps: 14118.69 (r/w/o: 14118.69/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 14133.11 qps: 14133.11 (r/w/o: 14133.11/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 14101.35 qps: 14101.35 (r/w/o: 14101.35/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 13577.57 qps: 13577.57 (r/w/o: 13577.57/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 13392.83 qps: 13392.83 (r/w/o: 13392.83/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 13571.50 qps: 13571.50 (r/w/o: 13571.50/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 13545.95 qps: 13545.95 (r/w/o: 13545.95/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 13715.29 qps: 13715.29 (r/w/o: 13715.29/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 13775.75 qps: 13775.75 (r/w/o: 13775.75/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 13619.61 qps: 13619.61 (r/w/o: 13619.61/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 13893.50 qps: 13893.50 (r/w/o: 13893.50/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1653600
        write:                           0
        other:                           0
        total:                           1653600
    transactions:                        1653600 (13777.91 per sec.)
    queries:                             1653600 (13777.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      13777.9117
    time elapsed:                        120.0182s
    total number of events:              1653600

Latency (ms):
         min:                                    0.14
         avg:                                    2.32
         max:                                   63.60
         95th percentile:                        3.55
         sum:                              3838895.46

Threads fairness:
    events (avg/stddev):           51675.0000/297.00
    execution time (avg/stddev):   119.9655/0.00